[
  {
      "id": 592479,
      "title": "Kale and Quinoa Salad with Black Beans",
      "readyInMinutes": 50,
      "servings": 6,
      "image":"Kale-and-Quinoa-Salad-with-Black-Beans-592479.jpg",
      "imageUrls": "weekly-meal-plan-17-777037.jpg",
      "ingredients": [
        "1 cup quinoa, uncooked",
        "6 cups chopped kale, de-stemmed",
        "1/2 red onion, chopped",
        "1 can black beans, drained and rinsed",
        "1 cup corn"
      ],
      "recipe":[
        "In a medium sized pot, combine 2 cups of water with 1 cup of quinoa and bring to a boil.",
        "Lower heat, cover and simmer for 15 minutes or until water is absorbed and quinoa is fluffy.",
        "In a large salad bowl, add the kale and the onion.",
        "Once the quinoa is done cooking, add in the black beans and corn to the pot. Mix it up.",
        "You could just add these over the kale but I wanted to warm up the beans and corn. Add the quinoa mixture over the kale and mix.",
        "Prepare the dressing. Pour the dressing over the salad, mix and enjoy!"
      ]
  },
  {
    "id": 547775,
    "title": "Creamy Avocado Pasta",
    "readyInMinutes": 15,
    "servings": 2,
    "image": "Creamy-Avocado-Pasta-547775.jpg",
    "imageUrls":[
        "Creamy-Avocado-Pasta-547775.jpg"
    ],
    "ingredients" : [
    "9 ounces (255 g) uncooked pasta",
    "1 medium garlic clove",
    "1/4 cup lightly packed fresh basil leaves, plus more for serving",
    "1 to 2 tablespoons fresh lemon juice, to taste",
    "1 tablespoon extra-virgin olive oil, plus more if needed",
    "1 ripe medium avocado, pitted",
    "1 tablespoon water",
    "1/4 to 1/2 teaspoon fine sea salt, to taste",
    "Freshly ground black pepper, to taste",
    "Lemon zest, for serving"
    ],
    "recipe":[
      "Bring a large pot of salted water to a boil. Cook the pasta according to the instructions on the package. For a lighter option, serve the avocado sauce with zucchini noodles.",
      "While the pasta cooks, make the sauce: In a food processor, combine the garlic and basil and pulse to mince. Add the lemon juice, oil, avocado, and 1 tablespoon water and process until smooth, stopping to scrape down the bowl as needed. If the sauce is too thick, add a bit more oil. Season with salt and pepper to taste.",
      "Drain the pasta and place it back in the pot. Add all of the avocado sauce and stir until combined. You can gently rewarm the pasta if it has cooled slightly, or simply serve it at room temperature.",
      "Top with pepper, lemon zest, and fresh basil leaves, if desired."
    ]
  },
  {
      "id": 818941,
      "title": "Avocado Toast with Eggs, Spinach, and Tomatoes",
      "readyInMinutes": 10,
      "servings": 1,
      "image": "avocado-toast-with-eggs-spinach-and-tomatoes-818941.jpg",
      "imageUrls": [
          "avocado-toast-with-eggs-spinach-and-tomatoes-818941.jpg"
      ],
    "ingredients":[ 
      "1/2 teaspoon minced shallot",
      "1 cup packed spinach leaves",
      "2 large egg whites or 1 large egg lightly beaten",
      "Salt and black pepper to taste",
      "1 slice Private Selection Multigrain bread toasted",
      "1/2 avocado pit and skin removed",
      "2 Private Selection Campari tomatoes sliced"
    ],
    "recipe":[
      "Spray a small skillet with non-stick cooking spray. Add the shallot and spinach and cook over medium heat until spinach is wilted. Place in a small bowl and set aside.",
      "Spray the pan again. Pour beaten egg whites or egg into the pan and season with salt and black pepper, to taste. Cook over medium heat until soft-scrambled, about 2 minutes.",
      "Mash the avocado with a fork and spread evenly on piece of toast. Top the avocado toast with spinach, scrambled eggs, and tomato slices. Season with salt and pepper, to taste. Serve immediately.",
      "Note-to make this gluten-free, use gluten-free bread."
    ]
  },
  {
      "id": 689502,
      "title": "Melt In Your Mouth Kale Salad",
      "readyInMinutes": 10,
      "servings": 2,
      "image": "Melt-In-Your-Mouth-Kale-Salad-689502.jpg",
      "imageUrls": [
          "Melt-In-Your-Mouth-Kale-Salad-689502.jpg"
      ],
      "ingredients":[
        "1 bunch of lacinato or dinosaur kale, stems removed, rinsed and patted dry",
        "⅓ cup currants (or chopped raisins)",
        "juice of one lemon",
        "1 tbsp of olive oil",
        "1 tsp local honey",
        "½ cup pine nuts toasted",
        "salt and pepper to taste",
        "4 tbsp grated raw parmesan cheese"
      ],
      "recipe":[
        "In a food processor, process kale into small chopped pieces",
        "To make dressing, stir lemon juice, olive oil, honey, salt and pepper together in a large bowl",
        "Add chopped kale, currants, pine nuts and parmesan to bowl with dressing",
        "Stir all ingredients together and serve"
      ]
  },
  {
      "id": 582897,
      "title": "Mexican Salad with Lime Dressing",
      "readyInMinutes": 15,
      "servings": 4,
      "image": "Mexican-Salad-with-Lime-Dressing-582897.jpg",
      "imageUrls": [
          "Mexican-Salad-with-Lime-Dressing-582897.jpg"
      ],
      "ingredients":[
        "1 large head Romaine Lettuce, rinsed, chopped and dried",
        "1 cup Cherry or grape tomatoes, halved (or large tomato, diced)",
       "1 avocado, diced",
        "1/2 English cucumber, sliced",
        "1/2 small yellow onion, thinly sliced",
        "1 cup Snap peas, whole, optional",
        "1/2 cup corn kernels",
        "1/3 bunch fresh cilantro"
      ],
      "recipe":[
        "Combine all salad dressing ingredients and shake or whisk them together then set aside.",
       "Chop all salad ingredients and combine in a large salad bowl.",
        "Shake salad dressing again prior to serving and drizzle the top with as much salad dressing as you prefer. Toss salad together and enjoy!"
    
      ]
  },
  {
      "id": 695486,
      "title": "Green Smoothie",
      "readyInMinutes": 10,
      "servings": 2,
      "image": "green-smoothie-695486.jpg",
      "imageUrls": [
          "green-smoothie-695486.jpg"
      ],
      "ingredients":[
        "2 cups spinach",
        "2 cups water",
        "1 cup mango",
        "1 cup pineapple",
        "2 bananas"
      ],
      "recipe":[
        "Tightly pack 2 cups of leafy greens in a measuring cup and then toss into blender.",
        "Add water and blend together until all leafy chunks are gone.",
        "Add mango, pineapple and bananas and blend again until smooth.",
        "Pour into a mason jar (or cute cup of your choice).",
        "Gulp or sip like a rawkstar!"
      ]
  },
  {
      "id": 812966,
      "title": "Low Carb Frosty",
      "readyInMinutes": 5,
      "servings": 1,
      "image": "low-carb-frosty-812966.jpg",
      "imageUrls": [
          "low-carb-frosty-812966.jpg"
      ],
      "ingredients":[
        "Heavy Cream ¾ cup",
        "¼ cup The Ultimate Icing Sugar Replacement by Swerve",
        "2 teaspoon Cacao Powder Raw Chocolate Powder Certified Organic by Navitas"
      ],
      "recipe":[
        "Add cream, sweetener and cacao powder to a small mixing bowl.",
        "With a hand mixer, whip cream until a stiff peak forms. Chill in the freezer for 25 minutes.",
        "Whip the mixture with a hand mixer again and serve chilled!"
      ]
  },
  {
      "id": 547899,
      "title": "Sweet Potato and Black Bean Mexican Salad",
      "readyInMinutes": 50,
      "servings": 4,
      "image": "Sweet-Potato-and-Black-Bean-Mexican-Salad-547899.jpg",
      "imageUrls": [
          "Sweet-Potato-and-Black-Bean-Mexican-Salad-547899.jpg"
      ],
      "ingredients":[
        "2 large sweet potatoes peeled and chopped",
        "1 tablespoon olive oil",
        "Salt and pepper to taste",
        "Romaine lettuce chopped",
        "1 15 oz black beans, rinsed and drained",
        "1 large tomato chopped",
        "1 cup corn fresh, frozen, or canned-rinsed and drained",
        "1 large avocado sliced",
        "1 cup chopped purple cabbage",
        "1/2 cup chopped cilantro",
        "1/4 cup chopped green onion"
      ],
      "recipe":[
        "Preheat oven to 400 degrees F. Place the chopped sweet potatoes on a large baking sheet. Drizzle with olive oil and toss. Season with salt and black pepper, to taste. Place sheet in the oven and roast for 20 minutes. Using a spatula, toss the sweet potatoes. Roast for an additional 15 minutes or until the sweet potatoes are tender. Remove from oven and set aside.",
        "Place chopped lettuce in a large bowl. Top lettuce with roasted sweet potatoes, black beans, tomatoes, corn, avocado, purple cabbage, cilantro, and green onion. Squeeze fresh lime juice over the salad. Serve with salsa, pico de gallo or Creamy Avocado Dressing, if desired.",
        "Note-I like to roast or grill the corn for the salad. This salad is very flexible. Feel free to add your favorite Mexican toppings to the mix. Don't use the avocado dressing if you need the salad to be vegan."
      ]
  },
  {
      "id": 613079,
      "title": "Smashed White Bean and Avocado Sandwich",
      "readyInMinutes": 10,
      "servings": 4,
      "image": "Smashed-White-Bean-and-Avocado-Sandwich-613079.jpg",
      "imageUrls": [
          "Smashed-White-Bean-and-Avocado-Sandwich-613079.jpg"
      ],
      "ingredients":[
        "1 heaped tablespoon whole grain dijon mustard",
        "salt and pepper to taste",
        "1 15 oz can white beans, drained and rinsed",
        "1 avocado, sliced",
        "juice of half a lemon",
        "2 tablespoons fresh basil leaves, finely chopped",
        "for the sandwich (optional): baby spinach, romaine, arugula, tomato slices"
      ],
      "recipe":[
        "Pour white beans into a large bowl and mashed a little with a potato masher. Add in the diced avocado and lemon juice, then mash until there are just a few chunks of bean and avocado left. Stir in the mustard, basil, salt and pepper, then taste and adjust flavors as necessary.",
        "Spoon onto a sandwich, salad, veggie bowl, or just eat it as is! It's delicious any way!"
      ]
  },
  {
      "id": 512226,
      "title": "Creamy Broccoli Spinach Soup | A Bowl of Green",
      "readyInMinutes": 15,
      "servings": 2,
      "image": "Creamy-Broccoli-Spinach-Soup---A-Bowl-of-Green-512226.jpg",
      "imageUrls": [
          "Creamy-Broccoli-Spinach-Soup---A-Bowl-of-Green-512226.jpg"
      ],
      "ingredients":[
        "4 stalks of celery, chopped",
       "1 head of broccoli, stalks peeled and stems and stalk coarsely chopped",
        "1 medium zucchini, chopped",
        "3oz/85g green beans, chopped",
        "1 large handful flat leaf parsley, stems removed",
        "2 cloves of garlic, grated",
        "1 green onion, chopped",
        "2 teaspoons extra virgin olive oil",
        "1 teaspoon fine seas salt",
        "4 cups/ ml filtered water",
        "3oz/85g baby spinach"
      ],
      "recipe":[
        "Place celery, broccoli, zucchini, green beans, parsley, garlic, green onion, olive oil, salt and water in a large soup or stock pot. Bring to a boil, lower heat and simmer for 10 minutes until vegetables are softened, stir in spinach and cook for another 5 minutes.",
       "Blend soup (in batches if necessary) in a blender until smooth. Serve immediately."
      ]
  },
  {
      "id": 584594,
      "title": "Vegetable Stir-Fry with Endive & Shiitake Mushrooms",
      "readyInMinutes": 15,
      "servings": 4,
      "image": "Vegetable-Stir-Fry-with-Endive---Shiitake-Mushrooms-584594.jpg",
      "imageUrls": [
          "Vegetable-Stir-Fry-with-Endive---Shiitake-Mushrooms-584594.jpg"
      ],
      "ingredients":[
        "2 teaspoons canola oil",
        "1 tablespoon minced fresh ginger",
        "3 cloves garlic minced",
        "8 ounces shiitake mushrooms sliced",
        "8 ounces crimini or Baby Bella mushrooms, sliced",
        "4 heads endive cut in half lengthwise, then sliced crosswise",
        "1 tablespoon + 2 teaspoons soy sauce",
        "3/4 teaspoon chili garlic sauce"
      ],
      "recipe":[
        "Heat the canola oil in a large nonstick skillet set over medium-high heat.",
        "Add the ginger and cook, stirring, for 1 minute. Add the garlic and cook for additional 30 seconds.",
        "Add the shiitake and crimini mushrooms, and cook until the mushrooms are almost soft, about 3 minutes.",
        "Add the endive and cook until tender, about 2 minutes.",
        "Stir in the soy sauce and chili-garlic sauce. Serve."
      ]
  },
  {
      "id": 612082,
      "title": "Creamy Butternut Squash Pasta Skillet",
      "readyInMinutes": 50,
      "servings": 6,
      "image": "Creamy-Butternut-Squash-Pasta-Skillet-612082.jpg",
      "imageUrls": [
          "Creamy-Butternut-Squash-Pasta-Skillet-612082.jpg"
      ],
      "ingredients":[
        "16 ounces whole wheat pasta shells",
        "1 tablespoon olive oil",
        "1 medium onion, chopped",
        "2 cloves garlic, minced",
        "1 large carrot, peeled and chopped",
        "4 ounces baby bella mushrooms, sliced",
        "3 cups bite-sized pieces of kale (stems removed before chopping!)",
        "1 ½ cups butternut squash puree (homemade or store-bought)",
        "1 cup 2% milk",
        "½ cup low-sodium vegetable broth",
        "1 tablespoon minced fresh rosemary",
        "1 tablespoon minced fresh sage leaves",
       "1 ½ cups freshly shredded provolone cheese, divided",
        "salt and pepper, to taste",
        "¼ cup freshly grated parmesan cheese",
        "⅓ cup raw walnuts, finely chopped"
      ],
      "recipe":[
        "Preheat the oven to 350ºF.",
        "Bring a large pot of lightly salted water to a boil. Add in the pasta and cook according to the package directions until al dente. Drain and set aside.",
        "Meanwhile, set a large oven-safe skillet over medium heat. Add in the olive oil. When hot, add in the onion and cook for about 2 minutes, until it starts to soften. Add in the garlic and cook for 30 seconds, until fragrant. Add in the carrot and mushrooms. Cook for about 5 minutes until tender. Add in the kale and cook for about 1 to 2 minutes, until bright green and slightly wilted.",
        "Add in the butternut squash puree, milk, vegetable broth, rosemary and sage. Mix until combined then bring the mixture to a gentle simmer (increasing the heat slightly). Let the mixture simmer gently for about 3 to 4 minutes, stirring fairly often, until it thickens up a bit (it won’t be super thick - just saucy). Turn off the heat.",
        "Add in the drained pasta and ½ cup of the provolone cheese. Mix until combined. Taste and season with salt / pepper (I usually add about ½ teaspoon salt, ¼ teaspoon pepper).",
        "Top with the remaining 1 cup provolone, the parmesan and the walnuts.",
        "Transfer the skillet to the oven and bake for about 8 to 10 minutes, until the cheese is nice and melted."
      ]
  },
  {
      "id": 749594,
      "title": "Hummus and Grilled Vegetable Wrap",
      "readyInMinutes": 23,
      "servings": 4,
      "image": "hummus-and-grilled-vegetable-wrap-749594.jpeg",
      "imageUrls": [
          "hummus-and-grilled-vegetable-wrap-749594.jpeg"
      ],
      "ingredients":[
        "2 medium zucchini, cut lengthwise into 1/4-inch slices",
        "2 teaspoons olive oil",
        "1/8 teaspoon salt",
        "Pinch freshly ground black pepper",
        "1 cup store-bought hummus",
        "4 pieces whole-wheat wrap bread (about 9 inches in diameter)",
        "1/4 cup pine nuts, toasted",
        "1 medium red bell pepper, thinly sliced",
        "2 ounces baby spinach leaves (2 cups lightly packed)",
        "1/2 cup red onion thinly sliced into half moons",
        "1/4 cup fresh mint leaves"
      ],
      "recipe":[
        "Preheat the grill or grill pan over medium heat. Brush both sides of the zucchini slices with the oil and sprinkle with the salt and pepper. Grill until tender and slightly browned, about 4 minutes per side.",
        "Spread 1/4 cup of the hummus over each piece of bread. Sprinkle 1 tablespoon of pine nuts on top. Top with 3 slices of zucchini, 2 pieces of red pepper, 1/2 cup of the spinach, a few sliced onions, and 1 tablespoon of the mint. Roll each of them up and cut in half on a diagonal."
      ]
  },
  {
      "id": 500803,
      "title": "Three Color Pasta with Sun Dried Tomato Sauce",
      "readyInMinutes": 15,
      "servings": 1,
      "image": "Three-Color-Pasta-with-Sun-Dried-Tomato-Sauce-500803.jpg",
      "imageUrls": [
          "Three-Color-Pasta-with-Sun-Dried-Tomato-Sauce-500803.jpg"
      ],
      "ingredients":[
       "1 medium carrot",
        "1 small-medium zucchini",
        "2 ounces whole wheat spaghetti (a small handful)*",
        "1/3-1/2 cup tomato sauce",
       "3 Tbsp sun dried tomato spread (or pureed sun-dried tomatoes)",
        "Vegan parmesan cheese (optional)",
        "Fresh basil (optional)"
      ],
      "recipe":[
        "Cook the noodles according to package instructions, shooting for al dente.",
        "Rinse and peel any rough skin spots from the carrot and zucchini. Then continue using the peeler to ‘ribbon’ them into noodles.",
        "Combine and warm your tomato sauce and sun dried tomato spread in a medium saucepan over low-medium heat, stirring to combine and adding a little water if too thick.",
        "Once noodles are done, scoop them into a strainer (reserving the water) and cover with towel to keep them moist.",
        "Place zucchini and carrot noodles in the pasta water and boil for 3-4 minutes until tender or ‘al dente.’",
        "Add pasta noodles and vegetable noodles into the sauce, toss lightly and serve immediately.",
        "Garnish with vegan parmesan cheese and basil for additional flavor."
      ]
  },
  {
      "id": 559162,
      "title": "Roasted Potatoes With Garlic Sauce",
      "readyInMinutes": 90,
      "servings": 4,
      "image": "Roasted-Potatoes-With-Garlic-Sauce-559162.jpg",
      "imageUrls": [
          "Roasted-Potatoes-With-Garlic-Sauce-559162.jpg"
      ],
      "ingredients":[
        "Garlic – 1 entire head, peeled. Believe me you’ll need fresh garlic for this recipe.",
        "Olive oil – To emulsify our sauce and create a cohesive condiment to drizzle over our potatoes.",
        "Parsley – Fresh and chopped up fine.",
        "Salt – To season our sauce, this element is very important so be sure not to skip the seasoning!",
        "Water – To thin out our sauce a and achieve the consistency we’re looking for.",
        "Potatoes – Feel free to use your favorite potatoes for roasting, whatever those may be. Just be sure to clean them and peel them. Before chopping them up into bite sized pieces.",
        "Seasoning – Salt and pepper, be sure to season every level of our dish.",
        "Olive oil – We need an oil to ensure our pieces of potato crisp up nicely in the oven."
      ],
      "recipe":[
        "Preheat oven: To 400 F degrees.",
        "Form the sauce: Put the garlic and salt in a mortar and pestle and crush the garlic until it becomes a paste. Add the oil, parsley and water to the garlic and mix well. Set aside.",
        "Prepare the potatoes: Cut up the potatoes into wedges or cubes. Transfer the potatoes to a baking sheet, season with salt and pepper, drizzle with olive oil and add half of the garlic sauce over them. Toss them well then cover with aluminum foil and bake for 30 minutes covered, after 30 minutes remove the aluminum foil and bake for another 30 minutes until they turn crispy and golden brown.",
        "Finish the dish: Before serving, pour garlic sauce over the hot potatoes or use the sauce as a dip.",
        "freshly diced potatoes tossed in herbs and garlic on a baking sheet"
      ]
  },
  {
      "id": 488633,
      "title": "gobi pakora , how to make gobi pakoras or cauliflower fritters",
      "readyInMinutes": 50,
      "servings": 3,
      "image": "gobi-pakora---how-to-make-gobi-pakoras-or-cauliflower-fritters-488633.jpg",
      "imageUrls": [
          "gobi-pakora---how-to-make-gobi-pakoras-or-cauliflower-fritters-488633.jpg"
      ],
      "ingredients":[
        "3 cup cauliflower florets (cut into about 1 inch florets)",
        "1/3 cup besan (gram flour )",
        "3 Tbsp corn starch (arrow root)",
        "2 tsp coriander powder (dhania)",
        "1/2 tsp cumin seeds (jeera)",
        "1/4 tsp red chili powder",
        "1/8 tsp baking soda",
        "1/2 tsp salt",
        "1 tsp ginger paste",
        "1 green chili (finely chopped)",
        "2 Tbsp cilantro (finely chopped, hara dhania)"
      ],
      "recipe":[ 
        "Boil the cauliflowers, add just enough water to cover the cauliflowers. After water comes to boil, cook for about 5 minutes over medium heat. Turn off the heat and drain the water. Let cauliflowers come to room temperature. Cauliflower should be just little tender, not soft.",
        "In a bowl mix all the ingredients together, besan, corn starch, coriander powder, cumin seeds, red chili powder, salt, baking soda, ginger, green chili and cilantro. Mix it well.",
        "Sprinkle the dry mix over cauliflower, gently mix it coating all the cauliflower with spices, add water little at a time as needed, I used about ¼ cup of water.",
        "Heat the oil in a frying pan on medium high heat. The frying pan should have about 1 inch of oil. To check if the oil is ready, put little batter in the oil. The batter should raise to the top but not change color right away.",
        "Drop the cauliflower slowly in the oil making sure don’t overlap them.",
        "Fry the cauliflowers until they turn golden brown, turning them occasionally. This should take about 6-8 minutes.",
        "When they are golden brown, take them out with a slotted spoon. Place them on a paper towel to absorb the extra oil. "
      ]
  },
  {
      "id": 814122,
      "title": "Massaged Kale Salad with Avocado and Pickled Red Onions",
      "readyInMinutes": 15,
      "servings": 4,
      "image": "massaged-kale-salad-with-avocado-and-pickled-red-onions-814122.jpg",
      "imageUrls": [
          "massaged-kale-salad-with-avocado-and-pickled-red-onions-814122.jpg"
      ],
      "ingredients":[
        "1 leaves head red kale finely chopped",
        "4 tablespoons lemon juice separated",
        "4 tablespoons olive oil",
        "1 teaspoon sea salt",
        "1 large ripe avocado peeled and diced",
        "1/3 cup pickled red onions*",
        "2 tablespoons sunflower seeds"
      ],
      "recipe":[  
        "Wash the kale leaves and pat them dry.Remove the leaves from the stems and finely chop the leaves (you can save the stems for smoothies or feed them to your dog!).",
        " Place the kale leaves in a large serving bowl and add half the lemon juice. Massage the kale leaves (taking large amounts in your palms as though you're ringing out a dish towel) until they begin to wilt and soften, about 2 to 3 minutes.",
        "Allow the leaves to sit 10 minutes to soften further.",
        "In a small bowl, whisk together the remaining lemon juice, olive oil, and sea salt.",
        " Pour dressing over the salad.",
        "Add the diced avocado, pickled red onions, and sunflower seeds, and toss everything together until well combined. ",
        "Serve alongside your favorite entree, and enjoy!"
      ]
  },
  {
      "id": 780510,
      "title": "Zucchini Noodles with Creamy Avocado Pesto",
      "readyInMinutes": 30,
      "servings": 2,
      "image": "zucchini-noodles-with-creamy-avocado-pesto-780510.jpg",
      "imageUrls": [
          "zucchini-noodles-with-creamy-avocado-pesto-780510.jpg"
      ],
      "ingredients":[
        "6 large zucchini, spiralized",
        "1 Tbsp olive oil",
        "2 ripe avocados",
        "1 cup fresh basil leaves",
        "3 cloves garlic",
        "¼ cup pine nuts",
        "2 Tbsp lemon juice",
        "½ tsp. sea salt",
        "3 Tbsp olive oil"
      ],
      "recipe":[
        {"1":"Spiralize your zucchini and set aside on paper towels so that any excess water is soaked up."},
        {"2":"In a food processor, add avocados, basil leaves, garlic, pine nuts, lemon juice and sea salt and pulse until finely chopped. Then with the motor still running, add olive oil in a slow stream until emulsified and creamy."},
        {"3":" Drizzle olive oil in a large skillet over medium high heat then add zucchini noodles, cooking for about 1 to 2 minutes until tender."},
        {"4":"Add zucchini noodles to a large bowl and toss with avocado pesto. Season with cracked pepper and a little Parmesan, serve and enjoy!"}
      ]
  },
  {
      "id": 483358,
      "title": "Garlicky Lemon Grilled Fish Packets",
      "readyInMinutes": 17,
      "servings": 2,
      "image": "Garlicky-Lemon-Grilled-Fish-Packets-483358.jpg",
      "imageUrls": [
          "Garlicky-Lemon-Grilled-Fish-Packets-483358.jpg"
      ],
      "ingredients":[
        "1 medium onion sliced",
        "1 c green beans cut in 1 in. pieces",
        "1 medium summer squash I used kousa",
        "1 juice of lemon",
        "2 cloves garlic minced",
        "2 tilapia filets",
        "1/4 c fresh parsley chopped",
        "salt and pepper"
      ],
      "recipe":[
        "Heat grill on high.Tear our 4 pieces of foil and lay two pieces on top of one another.",
        "Spray center of foil with a little non-stick cooking spray to prevent the fish from sticking.In a medium bowl, combine onion slices, green beans and summer squash.",
        "Add juice of 1 lemon, garlic and salt and pepper to taste.Season tilapia filets with salt and pepper on each side and place each portion in center of the foil.",
        "Top each piece of fish with equal parts of the vegetable mixture.Sprinkle fresh parsley on top of the vegetables before sealing.",
        "Bring the two wide ends of the foil together and fold to seal.",
        "Gently fold in the smaller ends of the packet and continue to fold until tightly secured. Leave a bit of room in the packet for steam to form.",
        "Grill for 5-7 minutes, turning once.Garnish with fresh parsley and lemon juice before serving."
      ]
  },
  {
      "id": 248799,
      "title": "Sweet Chili Chicken Salad",
      "readyInMinutes": 15,
      "servings": 4,
      "image": "Sweet-Chili-Chicken-Salad-248799.jpg",
      "imageUrls": [
          "Sweet-Chili-Chicken-Salad-248799.jpg"
      ],
      "ingredients":[
        "2 cups chicken, cooked and shredded",
        "4 cups lettuce, sliced",
        "2 cups bean sprout",
        "1/2 red pepper, sliced thinly",
        "1/2 cup carrot, sliced thinly",
        "1 cup cucumber, sliced",
        "2 green onions, sliced",
        "peanuts to taste, toasted and chopped",
        "1/4 cup sweet chili dressing"
      ],
      "recipe":[
        "Toss everything and enjoy!"
      ]
  },
  {
      "id": 584481,
      "title": "Open Faced Veggie Quesadilla with Avocado Salsa Cream",
      "readyInMinutes": 18,
      "servings": 1,
      "image": "Open-Faced-Veggie-Quesadilla-with-Avocado-Salsa-Cream-584481.jpg",
      "imageUrls": [
          "Open-Faced-Veggie-Quesadilla-with-Avocado-Salsa-Cream-584481.jpg"
      ],
      "ingredients":[
        "4 whole Flour Tortillas",
        "2 Tablespoons Olive Oil",
        "1 whole Onion, Thinly Sliced",
        "¼ teaspoons Salt To Taste",
        "½ cups Green Bell Pepper, Diced",
        "½ cups Yellow Bell Pepper, Diced",
        "½ cups Red Bell Pepper, Diced",
        "½ cups Black Olives, Chopped",
        "¼ cups Enchilada Sauce",
        "½ cups Black Olives, Chopped",
        "1 cup Shredded Monterey Jack Cheese",
        "¼ cups Fresh Cilantro, Chopped",
        "¼ cups Sour Cream For Garnish"
      ],
      "recipe":[
        "Preheat oven to 400 F. Place tortillas on an ungreased baking sheet, lightly spray with cooking spray and prick all over with a fork.",
        "Bake for 5-6 minutes, until they are puffed and begin to turn golden. Remove from oven and allow to cool. Keep the oven on.",
        "In a large skillet, heat the olive oil over medium heat.",
        "Add the sliced onions to the skillet, season with salt and pepper to taste, and cook over medium-low heat, stirring occasionally, until onions turn translucent and begin to caramelize (about 8-10 minutes). When the onions are almost done, add the diced peppers and cook just until they begin to soften. Remove skillet from heat.",
        "Spoon about 1-2 tablespoons of enchilada sauce over each of the baked tortillas. Top with the onions and veggie mixture, olives and cheese.",
        "Place it back in the oven and cook for 5-6 more minutes, until the cheese has melted. Remove from oven and garnish with fresh cilantro and sour cream."
      ]
    }
]